숫자 데이터를 시리즈로 만들어 주세요.
값은 [5, 10, 15, 20] 이고, 인덱스는 자동으로 생성됩니다.

숫자 데이터를 시리즈로 만들어 주세요.
값은 [2, 4, 6, 8] 이고, 인덱스는 자동으로 생성됩니다.

In [29]:
import pandas as pd
import numpy as np

In [2]:
num = pd.Series([5, 10, 15, 20])

In [3]:
num

0     5
1    10
2    15
3    20
dtype: int64

In [4]:
num = pd.Series([2, 4, 6, 8])

In [5]:
num

0    2
1    4
2    6
3    8
dtype: int64

# 성적 데이터를 시리즈로 만들어주세요.
값은 점수 [70, 80, 90] 이고, 인덱스는 과목 ['국어', '영어', '수학'] 입니다.

1. 국어 점수를 조회하세요. (결과: 70점)
2. 수학 점수를 75점으로 수정하세요.

In [8]:
score = pd.Series([70, 80, 90], index=['국어', '영어', '수학'])
score

국어    70
영어    80
수학    90
dtype: int64

In [7]:
print(score['국어'])

70

In [9]:
score['수학'] = 75

In [10]:
score

국어    70
영어    80
수학    75
dtype: int64

# 계절별 평균 기온 데이터를 시리즈로 만들어주세요.
값은 기온 [15, 27, 18] 이고, 인덱스는 계절 ['봄', '여름', '가을'] 입니다.

1. 봄 기온을 조회하세요. (결과: 15)
2. 가을 기온을 20으로 수정하세요.

In [11]:
temp = pd.Series([15, 27, 18], index=['봄', '여름', '가을'])
temp

봄     15
여름    27
가을    18
dtype: int64

In [12]:
temp['봄']

np.int64(15)

In [13]:
temp['가을'] = 20
temp

봄     15
여름    27
가을    20
dtype: int64

# 일별 매출 데이터를 시리즈로 만들어주세요.
값은 매출 [1000, 1200, 1300] 이고, 인덱스는 날짜 ['01-01', '01-02', '01-03'] 입니다.

1. 1월 1일 매출을 조회하세요. (결과: 1000)
2. 1월 2일 매출을 1250으로 수정하세요.

In [14]:
day_money = pd.Series([1000, 1200, 1300], index=['01-01', '01-02', '01-03'])
day_money

01-01    1000
01-02    1200
01-03    1300
dtype: int64

In [15]:
day_money['01-01']

np.int64(1000)

In [16]:
day_money['01-02'] = 1250
day_money

01-01    1000
01-02    1250
01-03    1300
dtype: int64

# 요일별 매출 데이터를 시리즈로 만들어주세요.
값은 매출 [300, 400, 500] 이고, 인덱스는 요일 ['월', '화', '수'] 입니다.

1. 화요일 매출을 조회하세요. (결과: 400)
2. 수요일 매출을 550으로 수정하세요.

In [17]:
day_money = pd.Series([300, 400, 500], index=['월', '화', '수'])
day_money

월    300
화    400
수    500
dtype: int64

In [18]:
day_money['화']

np.int64(400)

In [19]:
day_money['수'] = 550

# 학생 성적 데이터를 데이터프레임으로 만들어주세요.
첫 번째 열은 학생 이름: ["철수", "영희", "민수"]
두 번째 열은 수학 점수: [85, 90, 78]

# 요일별 매출 데이터를 데이터프레임으로 만들어주세요.
첫 번째 열은 요일: ["월", "화", "수"]
두 번째 열은 매출: [1000, 1200, 900]

In [26]:
student = {'학생이름': ['철수', '영희', '민수'],
          '수학점수': [85, 90, 78]}
total = pd.DataFrame(student)
total

  학생이름  수학점수
0   철수    85
1   영희    90
2   민수    78

In [28]:
day = {'요일' : ['월', '화', '수'],
      '매출' : [1000, 1200, 900]}
total = pd.DataFrame(day)
total

  요일    매출
0  월  1000
1  화  1200
2  수   900

# 과일 판매 데이터를 데이터프레임으로 만들어주세요.
값은 [[30, 50], [20, 40]]
행 이름(index)은 ['사과', '배']
열 이름(columns)은 ['판매량', '재고']

1. 사과의 판매량을 조회하세요. (결과: 30)
2. 새로운 열 '가격'을 추가하고, 사과는 1000원, 배는 1200원으로 입력하세요.

In [46]:
fru = np.array([[30, 50], [20, 40]])
fruit = pd.DataFrame(fru,
                    index=['사과', '배'],
                    columns=['판매량', '재고'])

In [60]:
fruit.loc['사과'].iloc[0]

np.int64(30)

In [47]:
fruit['가격'] = [1000, 1200]

In [48]:
fruit

    판매량  재고    가격
사과   30  50  1000
배    20  40  1200

# 도시 데이터를 데이터프레임으로 만들어주세요.
값은 [[950, 1200], [500, 800]]
행 이름(index)은 ['서울', '부산']
열 이름(columns)은 ['인구', '면적']

1. 서울의 면적을 조회하세요. (결과: 1200)
2. 새로운 열 '특산물'을 추가하고, 서울은 "김치", 부산은 "어묵"으로 입력하세요.

In [41]:
city = np.array([[950, 1200], [500, 800]])
city = pd.DataFrame(city,
                   index=['서울', '부산'],
                   columns=['인구', '면적'])
city

     인구    면적
서울  950  1200
부산  500   800

In [61]:
city.loc['서울'].iloc[1]

np.int64(1200)

In [42]:
city['특산물'] = ['김치', '어묵']

In [43]:
city

     인구    면적 특산물
서울  950  1200  김치
부산  500   800  어묵

# 도서 데이터를 데이터프레임으로 만들어주세요.
값은 [[15000, '홍길동전'], [20000, '해리포터']]
행 이름(index)은 ['책1', '책2']
열 이름(columns)은 ['가격', '제목']

1. 책2의 가격을 조회하세요. (결과: 20000)
2. 새로운 열 '저자'를 가격 뒤에 추가하고, 책1은 "허균", 책2는 "J.K. 롤링"으로 입력하세요.

In [76]:
book = np.array([[15000, '홍길동전'], [20000, '해리포터']])
book = pd.DataFrame(book,
                   index=['책1', '책2'],
                   columns=['가격', '제목'])
book

       가격    제목
책1  15000  홍길동전
책2  20000  해리포터

In [77]:
book.loc['책2'].iloc[0]

'20000'

In [78]:
book.insert(1, '저자', ['허균', 'J.K. 롤링'])

In [79]:
book

       가격       저자    제목
책1  15000       허균  홍길동전
책2  20000  J.K. 롤링  해리포터

# 영화 데이터를 데이터프레임으로 만들어주세요.
값은 [[9.0, 14000], [8.2, 9500]]
행 이름(index)은 ['기생충', '인터스텔라']
열 이름(columns)은 ['평점', '관객수']

1. 영화 기생충의 평점을 조회하세요. (결과: 9.0)
2. '관객수' 열을 삭제하세요.

In [69]:
movie = np.array([[9.0, 14000], [8.2, 9500]])
movie = pd.DataFrame(movie,
                     index=['기생충', '인터스텔라'],
                     columns=['평점', '관객수'])
movie

        평점      관객수
기생충    9.0  14000.0
인터스텔라  8.2   9500.0

In [70]:
movie.loc['기생충'].iloc[0]

np.float64(9.0)

In [71]:
movie = movie.drop('관객수', axis=1)

In [72]:
movie

        평점
기생충    9.0
인터스텔라  8.2

# 학생 점수 데이터를 시리즈로 만들어주세요.
값은 점수 [80, 90, 75, 85] 이고, 인덱스는 과목 ['국어', '영어', '수학', '과학'] 입니다.

1. 총점을 구하세요.
2. 평균 점수를 구하세요.
3. 가장 높은 점수를 구하세요.
4. 가장 낮은 점수를 구하세요.

In [81]:
score = pd.Series([80, 90, 75, 85], index=['국어', '영어', '수학', '과학'])
score

국어    80
영어    90
수학    75
과학    85
dtype: int64

In [94]:
print('총점:', score.sum())

총점: 330

In [95]:
print('평균 점수:', score.mean())

평균 점수: 82.5

In [96]:
print('최고 점수:', score.max())

최고 점수: 90

In [97]:
print('최저 점수:', score.min())

최저 점수: 75

# 일주일 동안의 기온 데이터를 시리즈로 만들어주세요.
값은 기온 [2, 5, -1, 0, 7, -3, 4] 이고, 인덱스는 요일 ['월', '화', '수', '목', '금', '토', '일'] 입니다.

1. 영상(0°C 이상)인 날만 골라내세요.

In [98]:
temp = pd.Series([2, 5, -1, 0, 7, -3, 4], index=['월', '화', '수', '목', '금', '토', '일'])
temp[temp >= 0]

월    2
화    5
목    0
금    7
일    4
dtype: int64

# 영화 데이터를 데이터프레임으로 만들어주세요.
값은 [[12000, 9.0], [8000, 8.5], [15000, 9.3]]
행 이름(index)은 ['기생충', '인터스텔라', '아바타']
열 이름(columns)은 ['관객수', '평점']

1. 모든 영화의 관객수에 1000명을 추가하세요.
(결과: [13000, 9000, 16000])

2. 평점이 9.0 이상인 영화만 조회하세요.

In [99]:
movie = np.array([[12000, 9.0], [8000, 8.5], [15000, 9.3]])
movie = pd.DataFrame(movie,
                    index=['기생충', '인터스텔라', '아바타'],
                    columns=['관객수', '평점'])
movie

           관객수   평점
기생충    12000.0  9.0
인터스텔라   8000.0  8.5
아바타    15000.0  9.3

In [117]:
movie['관객수'] + 1000

기생충      13000.0
인터스텔라     9000.0
아바타      16000.0
Name: 관객수, dtype: float64

In [106]:
movie.loc[movie['평점'] >= 9.0]

         관객수   평점
기생충  12000.0  9.0
아바타  15000.0  9.3

# 상품 매출 데이터를 데이터프레임으로 만들어주세요.
값: [[25000, 30000], [40000, 15000]]
행 이름(index): [‘치마', '바지']
열 이름(columns): ['1월 매출', ‘2월 매출']

1. 새로운 열 '합계'를 추가하여 1월과 2월 매출의 합을 구하세요.
2. '합계'를 만원 단위로 바꾼 새로운 열 '합계(만원)'을 추가하세요.

In [162]:
sale = np.array([[25000, 30000], [40000, 15000]])
sale = pd.DataFrame(sale,
                   index=['치마', '바지'],
                   columns=['1월 매출', '2월 매출'])
sale

    1월 매출  2월 매출
치마  25000  30000
바지  40000  15000

In [163]:
sale['합계'] = sale['1월 매출'] + sale['2월 매출']
sale

    1월 매출  2월 매출     합계
치마  25000  30000  55000
바지  40000  15000  55000

In [164]:
sale['합계(만원)'] = (sale['1월 매출'] + sale['2월 매출']) / 10000
sale

    1월 매출  2월 매출     합계  합계(만원)
치마  25000  30000  55000     5.5
바지  40000  15000  55000     5.5

# 도시별 기온 데이터를 데이터 프레임으로 만들어 주세요.
데이터: [[20, 25, 15], [18, 22, 19], [25, 27, 23]]
행 이름(index): ['서울', '부산', '대구']
열 이름(columns): ['봄', '여름', '겨울']

1. 서울의 여름 기온을 빈값(NaN) 으로 변경하세요.
2. 빈값이 포함된 행을 삭제 하세요.
3. 부산의 봄 기온을 빈값(NaN) 으로 변경하세요.
4. 모든 빈값을 0으로 채우세요.

In [231]:
city = np.array([[20, 25, 15], [18, 22, 19], [25, 27, 23]])
city = pd.DataFrame(city,
                    index=['서울', '부산', '대구'],
                    columns=['봄', '여름', '겨울'])
city

     봄  여름  겨울
서울  20  25  15
부산  18  22  19
대구  25  27  23

In [232]:
city.loc['서울', '여름'] = np.nan
city

     봄    여름  겨울
서울  20   NaN  15
부산  18  22.0  19
대구  25  27.0  23

In [233]:
city = city.dropna(axis=0)
city

     봄    여름  겨울
부산  18  22.0  19
대구  25  27.0  23

In [234]:
city.loc['부산', '봄'] = np.nan
city

       봄    여름  겨울
부산   NaN  22.0  19
대구  25.0  27.0  23

In [235]:
city.fillna(0)

       봄    여름  겨울
부산   0.0  22.0  19
대구  25.0  27.0  23

# 학급별 점수 데이터를 데이터프레임으로 만드세요.
데이터: [[80, 75, 90], [85, 88, 82], [70, 65, 78]]
행 이름(index): ['국어', '영어', '수학']
열 이름(columns): ['1반', '2반', '3반']

1. 2반 영어 점수를 빈값(NaN) 으로 변경하세요.
2. 빈값이 포함된 열을 삭제하세요.
3. 3반 수학 점수를 빈값(NaN) 으로 변경하세요.
4. 모든 빈값을 100으로 채우세요.

In [166]:
student = np.array([[80, 75, 90], [85, 88, 82], [70, 65, 78]])
student = pd.DataFrame(student,
                       index=['국어', '영어', '수학'],
                       columns=['1반', '2반', '3반'])
student

    1반  2반  3반
국어  80  75  90
영어  85  88  82
수학  70  65  78

In [237]:
student.loc['영어', '2반'] = np.nan

In [238]:
student

    1반    2반  3반
국어  80  75.0  90
영어  85   NaN  82
수학  70  65.0  78

In [241]:
student = student.dropna(axis=1)
student

    1반  3반
국어  80  90
영어  85  82
수학  70  78

In [242]:
student.loc['수학', '3반'] = np.nan

In [243]:
student

    1반    3반
국어  80  90.0
영어  85  82.0
수학  70   NaN

In [246]:
student = student.fillna(100)
student

    1반     3반
국어  80   90.0
영어  85   82.0
수학  70  100.0